Repository: avirtual777/pychess-variants
Catalog: lang/*/LC_MESSAGES/client.po
Languages: de, it, pl, th

source: Sets that show both sides are available by going to settings.
de: Figurensets die beide Seiten anzeigen sind verfügbar in den Einstellungen.
it: Set che mostrano entrambi i lati sono disponibili nelle impostazioni.
pl: Zestawy figur pokazujące obie figury są dostępne w ustawieniach.
th: มีตัวหมากแบบเห็นด้านหลังให้เลือกในการตั้งค่า

source: Reading the rules are a necessity to understand the movements before playing.
de: Es ist wichtig die Regeln vor dem Spielen zu lesen, um die Bewegungen der Figuren zu verstehen.
it: Leggere le regole prima di giocare è fondamentale.
pl: Przeczytanie zasad jest niezbędne, aby zrozumieć jak figury się ruszają.
th: ควรอ่านกติกาเพื่อทำความเข้าใจวิธีเดินหมากแต่ละตัวก่อนเริ่มเล่น

source: makruk
th: หมากรุกไทย

source: makpong
th: หมากป้อง

source: ouk chaktrang
th: หมากรุกกัมพูชา

source: sittuyin
th: หมากรุกพม่า

source: asean
th: หมากรุกอาเซียน

source: xiangqi
th: หมากรุกจีน

source: janggi
th: หมากรุกเกาหลี

source: Lobby
th: ล็อบบี้

source: FAQ
th: คำถามที่พบบ่อย

source: Campmate
de: Eindrungsmatt
it: Campomatto
th: ยึดฐาน

source: Berserk
th: เบอร์เซิร์ก

source: Arena
th: อารีนา

source: Round-Robin
it: Torneo all'italiana
th: พบกันหมด

source: placement
it: pre-scacchi
