Repository: avirtual777/pychess-variants
Catalog: lang/*/LC_MESSAGES/client.po
Languages: de, it, pl, th

source: Your opponent offers a draw
de: Dein Gegner bietet Remis an
it: Il tuo avverasario offre la patta
pl: Przeciwnik proponuje remis
th: ฝ่ายตรงข้ามขอเสมอกับคุณ

source: Confirm move
pl: Potwierdzasz?
th: ยืนยันการเดิน

source: Are you sure you want to resign?
de: Bist du sicher, dass du aufgeben willst?
it: Sei sicuro di volere abbandonare?
pl: Na pewno chcesz się poddać?
th: ต้องการยอมแพ้จริงหรือไม่?

source: Blue (Cho)
de: Blau (Cho)
it: Blu (Cho)
pl: Niebieskie (Cho)
th: น้ำเงิน (โช)

source: Red (Han)
de: Rot (Han)
it: Rosso (Han)
pl: Czerwone (Han)
th: แดง (ฮัน)

source: Waiting for %1 to choose starting positions of the horses and elephants...
de: Warte bis %1 die Startposition für die Pferde und Elefanten ausgewählt hat...
it: Aspettando che %1 scelga le posizioni di patenza dei Cavalli e degli Elefanti...
pl: Oczekujemy aż %1 ustawią swoje skoczki i słonie...
th: กำลังรอให้ฝ่าย%1เลือกตำแหน่งเริ่มต้นของม้าและช้าง...

source: Switch pieces
de: Figuren wechseln
it: Cambia pezzi
pl: Zamień figury
th: สลับตัวหมาก

source: Ready
de: Bereit
it: Pronto
pl: Gotowe
th: พร้อม

source: VIEW REMATCH
de: REVANCHE ANSEHEN
it: GUARDA LA RIVINCITA
pl: ZOBACZ REWANŻ
th: ดูเกมที่เล่นอีก

source: Rematch offer sent
de: Angebot zur Revanche gesendet
it: Offerta di rivincita inviata
pl: Wysłałaś(eś) propozycję rewanżu
th: ส่งคำขอเล่นอีกแล้ว

source: Your opponent offers a rematch
de: Dein Gegner bietet eine Revanche an
it: Il tuo avversario offre la rivincita
pl: Przeciwnik proponuje rewanż
th: ฝ่ายตรงข้ามขอเล่นกับคุณอีกครั้ง

source: VIEW TOURNAMENT
de: TURNIER ANSEHEN
it: GUARDA IL TORNEO
pl: WYŚWIETL TURNIEJ
th: ดูหน้าการแข่งขัน

source: BACK TO TOURNAMENT
de: ZURÜCK ZUM TURNIER
it: RITORNA AL TORNEO
pl: WRÓĆ DO TURNIEJU
th: กลับสู่หน้าการแข่งขัน

source: PAUSE
de: PAUSIEREN
it: PAUSA
pl: PAUZA
th: หยุดชั่วคราว

source: REMATCH
de: REVANCHE
it: RIVINCITA
pl: REWANŻ
th: ขอเล่นอีก

source: NEW OPPONENT
de: NEUER GEGNER
it: NUOVO AVVERSARIO
pl: NOWY PRZECIWNIK
th: หาคู่ต่อสู้ใหม่

source: ANALYSIS BOARD
de: ANALYSEBRETT
it: SCACCHIERA DI ANALISI
pl: ANALIZA
th: วิเคราะห์เกม

source: Propose takeback
pl: Cofnij
th: ขอย้อนตาเดิน

source: Stop counting
de: Aufhören zu zählen
it: Ferma il conteggio
pl: Przerwij odliczanie
th: หยุดนับ

source: Stop
de: Stopp
pl: Przerwij
th: หยุด

source: Start counting
de: Anfangen zu zählen
it: Comincia il conteggio
pl: Zacznij odliczać
th: เริ่มนับ

source: %1 second to play the first move
de: %1 Sekunde um den ersten Zug zu spielen
it: %1 secondo per muovere
pl: %1 sekunda na wykonanie pierwszego ruchu
th: มีเวลาอีก %1 วินาทีสำหรับเดินตาแรก

source: Log out
de: Abmelden
it: Esci
pl: Wyloguj się
th: ออกจากระบบ

source: Are you sure you want to log out?
de: Bist du sicher dass du dich abmelden willst?
it: Sei sicuro di volerti disconnettere?
pl: Na pewno chcesz się wylogować?
th: ต้องการออกจากระบบจริงหรือไม่?

source: Sound
de: Ton
it: Suono
pl: Dźwięk
th: เสียง

source: Background
de: Hintergrund
it: Sfondo
pl: Tło
th: พื้นหลัง

source: Board Settings
de: Bretteinstellungen
it: Impostazioni scacchiera
pl: Ustawienia planszy
th: ตั้งค่ากระดาน

source: Zen Mode
de: Zen Modus
it: Modalità Zen
pl: Tryb zen
th: โหมดสมาธิ

source: Volume
de: Volumen
pl: Głośność
th: ระดับเสียง

source: First
de: Anfang
it: Primo
pl: Pierwsza
th: หน้าแรก

source: Prev
de: Vorheriges
it: Precedente
pl: Poprzednia
th: หน้าที่แล้ว

source: Next
de: Nächstes
it: Prossimo
pl: Następna
th: หน้าต่อไป

source: Last
de: Letztes
it: Ultimo
pl: Ostatnia
th: หน้าสุดท้าย

source: Scroll to your player
de: Zu deinem Spieler scrollen
it: Scorri alla tua posizione
pl: Przewiń do swojej pozycji
th: เลื่อนไปหาตัวเอง

source: WITHDRAW
de: VERLASSEN
it: RITIRATI
pl: WYCOFAJ SIĘ
th: ถอนตัว

source: JOIN
de: TEILNEHMEN
it: UNISCITI
pl: DOŁĄCZ
th: เข้าร่วม

source: LOG IN
de: EINLOGGEN
pl: ZALOGUJ SIĘ
th: เข้าสู่ระบบ

source: Tournament complete
de: Turnier beendet
it: Torneo completato
pl: Turniej zakończony
th: การแข่งขันเสร็จสิ้น

source: Players
de: Spieler
it: Giocatori
pl: Graczy
th: จำนวนผู้เล่น

source: Average rating
de: Durchschnittliche Wertung
it: Punteggio medio
pl: Średni ranking
th: คะแนนเฉลี่ย

source: Games played
de: Gespielte Partien
it: Partite giocate
pl: Partii rozegranych
th: จำนวนเกม

source: %1 wins
de: %1 Siege
it: %1 vittorie
pl: %1 wygrały
th: %1ชนะ

source: Draws
de: Remisen
it: Pareggi
pl: Remisy
th: เสมอ

source: Berserk rate
de: Beserkrate
it: Tasso di Berserk
pl: Procent berserków
th: อัตราเบอร์เซิร์ก

source: Download all games
de: Lade alle Partien herunter
it: Scarica tutte le partite
pl: Pobierz wszystkie partie
th: ดาวน์โหลดเกมทั้งหมด

source: Download all games in JSON
de: Lade alle Partien in JSON herunter
it: Scarica tutte le partite in JSON
pl: Pobierz wszystkie partie w formacie JSON
th: ดาวน์โหลดทุกเกมเป็น JSON

source: Swiss
de: Schweizer-System
it: Torneo svizzero
pl: System szwajcarski
th: สวิส

source: Performance
de: Turnierleistung
pl: Wynik
th: สมรรถนะ

source: Win rate
de: Gewinnrate
it: Tasso di vittorie
pl: Procent wygranych
th: อัตราชนะ

source: Average opponent
de: Durchschnittlicher Gegner
it: Avversario medio
pl: Średni ranking przeciwników
th: ค่าเฉลี่ยคู่แข่ง

source: Defender:
de: Verteidiger:
it: Difensore:
pl: Obrońca tytułu:
th: ผู้ป้องกันโล่:

source: Custom position
de: Benutzerdefinierte Stellung
it: Posizione personalizzata
pl: Niestandardowa pozycja początkowa
th: ตำแหน่งเริ่มต้นต่างจากปกติ

source: Analysis board
de: Analysebrett
it: Scacchiera d'analisi
pl: Analiza
th: ถอดหมาก

source: This Shield trophy is unique. The winner keeps it for one month, then must defend it during the next %1 Shield tournament!
de: Die Schild Trophäe ist einzigartig. Der Sieger behält sie für einen Monat, dann muss er sie beim nächsten %1 Schild-Turnier verteidigen!
it: Questo trofeo Shield è unico. Chi lo vince lo detiene per un mese, poi dovrà difenderlo durante il prossimo torneo Shield di %1!
pl: Shield jest wyjątkowym trofeum. Zwycięzca otrzymuje je na miesiąc i broni w następnym turnieju.
th: การแข่งชิงโล่มีความแตกต่างจากการแข่งทั่วไป ผู้ชนะจะได้ถือครองโล่เป็นเวลาหนึ่งเดือน จากนั้นจะต้องมาป้องกันโล่ในการแข่งชิงโล่%1ครั้งต่อไป!

source: STARTING IN
de: STARTET IN
it: INIZIA TRA
pl: START ZA
th: กำลังจะเริ่มในอีก

source: Chess Variants
de: Schach Varianten
it: Varianti degli scacchi
pl: Odmiany szachów
th: เกมหมากรุกสากล

source: Makruk Variants
de: Makruk Varianten
it: Varianti del Makruk
pl: Odmiany Makruka
th: เกมหมากรุกเอเชียอาคเนย์

source: Shogi Variants
de: Shogi Varianten
it: Varianti dello shogi
pl: Odmiany Shogi
th: เกมหมากรุกญี่ปุ่น

source: Xiangqi Variants
de: Xiangqi Varianten
it: Varianti dello Xiangqi
pl: Odmiany Xiangqi
th: เกมหมากรุกจีน

source: Fairy Piece Variants
de: Fairy Figuren Varianten
it: Varianti con pezzi eterodossi
pl: Odmiany z niestandardowymi figurami
th: เกมที่ใช้ตัวหมากพิเศษ

source: New Army Variants
de: Varianten mit neuer Armee
it: Varianti con nuovi schieramenti
pl: Odmiany z niestandardowymi armiami
th: เกมที่มีกองทัพใหม่

source: Page reload required after change
de: Seite neu laden nötig nach Änderung
it: È richiesto ricaricare la pagina dopo le modifiche
pl: Po zmianie tego należy odświeżyć stronę
th: จำเป็นต้องรีเฟรชหน้าเว็บหลังจากเปลี่ยนไฟล์

source: Off
de: Aus
it: Disattivo
pl: Wyłączony
th: ปิด

source: On
de: An
it: Attivo
pl: Włączony
th: เปิด

source: ZEN MODE
de: ZEN MODUS
it: MODALITÀ ZEN
pl: TRYB ZEN
th: โหมดสมาธิ

source: Castling
de: Rochade
it: Arrocco
pl: Roszady:
th: การเข้าป้อม

source: FLIP BOARD
de: BRETT DREHEN
it: RUOTA LA SCACCHIERA
pl: OBRÓĆ PLANSZĘ
th: กลับกระดาน

source: CLEAR BOARD
de: BRETT RÄUMEN
it: SVUOTA LA SCACCHIERA
pl: WYCZYŚĆ PLANSZĘ
th: ล้างกระดาน

source: FILL %1'S HAND
de: FÜLLE HAND VON %1
it: RIEMPI LA TASCA DEL %1
pl: WYPEŁNIJ RĘKĘ DRUGIEGO GRACZA
th: เติมหมากในมือฝ่าย%1ให้ครบ

source: STARTING POSITION
de: ANFANGSPOSITION
it: POSIZIONE DI PARTENZA
pl: POZYCJA POCZĄTKOWA
th: ตำแหน่งเริ่มต้น

source: PLAY WITH MACHINE
de: SPIELE MIT DEM COMPUTER
it: GIOCA CON IL COMPUTER
pl: ZAGRAJ Z KOMPUTEREM
th: เล่นกับคอมพิวเตอร์

source: EXPORT TO PNG
de: NACH PNG EXPORTIEREN
it: ESPORTA IN PGN
pl: Zapisz jako PNG
th: บันทึกเป็น PNG

source: Undo
de: Rückgängig
pl: Cofnij
th: ย้อนกลับ

source: Place the duck on an empty square.
de: Platziere die Ente auf ein leeres Feld.
pl: Umieść kaczkę na wolnym polu
th: วางเป็ดลงบนตาที่ว่างอยู่

source: These variants have new armies with completely new pieces! Most of these variants pit these armies against the standard Chess army.
de: Diese Varianten haben neue Armeen mit fast komplett neuen Figuren! Die meisten dieser Varianten stellen diese Armeen der Standard Schach Armee gegenüber.
it: Queste varianti hanno nuovi eserciti con pezzi completamente nuovi! Molte di queste varianti fanno scontrare questi nuovi schieramenti contro quello degli scacchi standard.
pl: Odmiany używające armii z całkowicie nowymi figurami. Większość z nich zestawia jedną z nich przeciwko zwykłej armii szachowej.
th: เกมเหล่านี้มีกองทัพที่ใช้ตัวหมากชนิดใหม่แทบทั้งหมด! ส่วนใหญ่จะนำกองทัพใหม่มาปะทะกับกองทัพหมากรุกสากลธรรมดา

source: Go Back
de: Zurückgehen
it: Torna indietro
pl: Wstecz
th: กลับ

source: Horde: Horse-based army
de: Horde: Auf Horde basierende Armee
it: Horde: esercito basato sui cavalli
pl: Horda: armia oparta na skoczkach
th: Horde: กองทัพม้า

source: Empire: Queen-based army
de: Empire: Auf Damen basierende Armee
it: Empire: esercito basato sulle Donne
pl: Empire: armia oparta na hetmanach
th: Empire: กองทัพควีน

source: Horde vs Horde
pl: Horda przeciwko Hordzie
th: Horde ปะทะ Horde

source: Clan: Drop-based army
de: Clan: Auf Einsetzen basierende Armee
it: Clan: esercito con paracadutaggi
pl: Klan: armia oparta na dostawianiu
th: Clan: กองทัพนินจา

source: Dynasty: Xiangqi-based army
de: Dynasty: Auf Xiangqi basierende Armee
it: Dynasty: esercito basato sullo Xiangqi
pl: Dynastia: armia wzorowana na Xiangqi
th: Dynasty: กองทัพหมากรุกจีน

source: Mayan chess
de: Maya-Schach
it: Scacchi maya
pl: Szachy majańskie
th: หมากรุกมายัน

source: Alternating pieces
de: Alternierende Figuren
pl: Przemieniające się figury
th: หมากสลับตัวไปมา

source: Spartans: Army with two kings
de: Spartaner: Armee mit zwei Königen
pl: Spartanie: armia z dwoma królami
th: Spartan: มีคิงสองคน

source: Variants using a basic chess set but with different rules.
de: Varianten die normale Schachfiguren benützen, aber mit unterschiedlichen Regeln.
it: Varianti che usano un set di scacchi classico, ma con regole diverse.
pl: Warianty używające standardowych figur, ale z innymi zasadami.
th: เกมที่ใช้ตัวหมากรุกสากลธรรมดา แล้วมีกฎเพิ่มเติม

source: These variants have new pieces to try! Many of them have larger boards, and some also have new rules.
de: Diese Varianten haben neue Figuren! Viele haben größere Bretter, einige auch andere Regeln.
it: Queste varianti hanno nuovi pezzi da provare! Molte hanno scacchiere più grandi, altre hanno nuove regole.
pl: Następujące odmiany mają nowe figury do wypróbowania. Wiele z nich używa większej planszy, a niektóre także dodatkowych reguł.
th: เกมเหล่านี้มีตัวหมากชนิดใหม่! บางเกมก็มีกระดานใหญ่ขึ้น บางเกมมีกฎเพิ่มด้วย

source: Southeast Asian variants, closely related to Western Chess.
de: Südöstliche asiatische Varianten, eng verwandt mit dem westlichen Schach.
it: Varianti del Sud-est asiatico, strettamente imparentate con gli scacchi occidentali.
pl: Warianty z Azji południowo-wschodniej, mocno zbliżone do standardowych szachów.
th: เกมจากภูมิภาคเอเชียอาคเนย์ มีความใกล้เคียงกับเกมจตุรงค์ดั้งเดิมเป็นอย่างยิ่ง

source: Thai Chess. Similar to Chess but with a different queen and bishop.
de: Thai Schach. Ähnlich wie Schach aber Dame und Läufer sind anders.
it: Scacchi thailandesi. Simili agli scacchi occidentali ma con Donna e Alfiere diversi.
pl: Szachy tajskie. Podobne do zwykłych, ale z innymi hetmanami i gońcami.
th: หมากรุกไทย

source: Makruk variant. Kings cannot move when checked.
de: Makruk Variante. Könige können sich nicht aus Schach bewegen.
it: Variante del Makruk. I Re non possono muoversi quando sotto scacco.
pl: Odmiana Makruka. Króle nie mogą się ruszyć spod szacha.
th: หมากป้อง เมื่อโดนรุกห้ามขยับขุนหนี

source: Cambodian Chess. Makruk with extra starting moves.
de: Kambodschanisches Schach. Makruk mit etwas mehr Eröffnungsmöglichkeiten.
it: Scacchi cambogiani. Makruk con qualche possibilità aggiuntiva in apertura.
pl: Szachy kambodżańskie. Makruk z kilkoma dodatkowymi możliwymi ruchami w debiucie.
th: หมากรุกกัมพูชา มีสูตรขุนและสูตรเม็ด

source: Burmese Chess. You may place your starting pieces.
de: Birmanisches Schach. Figuren werden am Anfang der Partie gesetzt.
it: Scacchi birmani. Piazza i tuoi pezzi all'inizio della partita.
pl: Szachy birmańskie. Możesz wybrać pozycje początkowe swoich figur.
th: หมากรุกพม่า เลือกวางหมากตอนเริ่มเกม

source: Makruk with International Chess influence.
de: Makruk mit internationalem Schach Einfluss
it: Makruk con influenze dagli scacchi internazionali.
pl: Makruk z modyfikacjami na wzór standardowych szachów.
th: หมากรุกเอเชียอาคเนย์ที่ได้รับอิทธิพลจากหมากรุกสากล

source: The Japanese version of chess, which involves drops and promotions.
de: Die japanische Version von Schach, mit Einsetzen und Beförderungen.
it: La versione giapponese degli scacchi, con paracadutaggi e promozioni.
pl: Japońska wersja szachów z promocjami i dostawianiem.
th: เกมหมากรุกจากประเทศญี่ปุ่น สามารถวางหมากที่กินกลับมาบนกระดาน และหมากส่วนใหญ่เลื่อนยศได้

source: Original Shogi
de: Originales Shogi
it: Shogi originale.
pl: Standardowe Shogi
th: หมากรุกญี่ปุ่นธรรมดา 9x9

source: 5x5 Shogi
it: Shogi 5x5
pl: Shogi 5x5
th: หมากรุกญี่ปุ่นเล็ก 5x5

source: 5x5, pieces flip each turn
de: 5x5, Figuren drehen sich nach jedem Zug um
it: 5x5, i pezzi si trasformano dopo ogni turno
pl: Shogi 5x5, figury przemieniają się po każdym ruchu
th: หมากพลิกไปพลิกมาทุกตา 5x5

source: 3x4 game to teach Shogi
de: 3x4 Spiel um Shogi beizubringen
it: Gioco 3x4 per insegnare lo Shogi
pl: Gra 3x4 do nauki Shogi
th: หมากรุกสัตว์สำหรับสอนเด็กเล็ก 3x4

source: 5x6 with Generals
de: 5x6 mit Generälen
it: 5x6 con Generali
pl: 5x6 z generałami
th: หมากรุกเล็กสำหรับฝึกใช้เงินและทอง 5x6

source: 7x7, Bird Shogi
de: 7x7, Vogel Shogi
it: 7x7, Tori Shogi
pl: Shogi 7x7 z ptasimi figurami
th: หมากรุกนก 7x7

source: The ancient game of Chinese Chess and its variants.
de: Das antike Spiel des Chinesischen Schachs und seine Varianten.
it: L'antico gioco degli scacchi cinesi e le sue varianti.
pl: Starożytne szachy chińskie i ich odmiany.
th: เกมหมากรุกจากประเทศจีน มีประวัติศาสตร์ยาวนานหลายพันปี

source: Chinese Chess, one of the most played games in the world
de: Chinesisches Schach, eines der meist gespielten Spiele der Welt.
it: Scacchi cinesi, uno dei giochi più giocati al mondo
pl: Szachy chińskie, jedna z najbardziej popularnych gier na świecie
th: หมากรุกจีน หนึ่งในเกมที่มีผู้เล่นมากที่สุดในโลก

source: Korean Chess, based on Xiangqi but very different
de: Koreanisches Schach, basierend auf Xiangqi aber sehr anders
it: Scacchi coreani, basati sullo Xiangqi ma molto differenti
pl: Szachy koreańskie wzorowane na Xiangqi, ale różniące się znacząco
th: หมากรุกเกาหลี พัฒนาจากหมากรุกจีนแต่เล่นต่างกันมาก

source: Compact Xiangqi on a 7x7 board
de: Kompaktes Xiangqi auf einem 7x7 Brett
it: Xiangqi compatto su una scacchiera 7x7
pl: Mniejsze Xiangqi na planszy 7x7
th: หมากรุกจีนขนาดเล็ก บนกระดาน 7x7

source: Asymmetric variant with one side having a super piece
de: Asymmetrische Variante wo eine Seite eine "Super"-Figur hat
it: Variante asimmetrica con un lato che possiede un pezzo molto potente
pl: Asymetryczna odmiana, w której jedna strona ma super-figurę.
th: เกมอสมมาตรที่ฝั่งหนึ่งมีแค่หมากระดับเทพตัวเดียวเท่านั้น

source: Rules
de: Regeln
it: Regole
pl: Zasady
th: กติกา

source: Tip:
de: Tipp:
it: Consiglio:
pl: Wskazówka:
th: เคล็ดลับ:

source: Fischer's random chess where the back row are randomized.
de: Fischer's Zufalls Schach, wo die letzte Reihe zufällig platziert wird.
it: Scacchi Fischer Random in cui i pezzi nelle traverse di partenza sono sempre in posizione differente.
pl: Szachy Fischerowskie z losowym ustawieniem figur na pierwszej linii.
th: หมากรุกสุ่มของฟิชเชอร์ ตำแหน่งเริ่มต้นแถวหลังมีได้ 960 แบบ

source: Crazyhouse with random back row.
de: Crazyhouse mit zufälliger Platzierung der letzten Reihe.
it: Crazyhouse con prima e ottava traversa randomizzate.
pl: Crazyhouse z losowym ustawieniem figur na pierwszej linii.
th: Crazyhouse ที่แถวหลังสุ่มด้วย

source: Atomic Chess with random back row.
de: Atomic Chess mit zufälliger Platzierung der letzten Reihe.
it: Atomic con prima e ottava traversa randomizzate.
pl: Szachy atomowe z losowym ustawieniem figur na pierwszej linii.
th: Atomic ที่แถวหลังสุ่มด้วย

source: Quack.
pl: Kwa, kwa.
th: ก้าบ

source: Move the king on top of the rook to castle.
de: Bewege den König auf den Turm um zu Rochieren.
it: Muovi il re sulla torre per arroccare.
pl: Roszuj grając królem na wieżę.
th: เข้าป้อมด้วยการเดินคิงใส่รุค

source: You can play more at lichess.org.
de: Du kannst mehr auf lichess.org spielen.
it: Ti consigliamo lichess.org
pl: Możesz więcej pograć na lichess.org.
th: สามารถเล่นได้ที่ lichess.org

source: Castling is only possible if the king and rook are dropped to their usual places like in standard Chess.
de: Rochieren is nur möglich wenn König und Turm auf ihre normalen Felder, wie in Schach, platziert werden.
it: L'arrocco è possibile solo se il re e la torre sono stati piazzati nelle case in cui si troverebbero negli scacchi standard.
pl: Roszowanie jest możliwe jedyne jeśli ustawisz króla i wieżę na ich standardowych pozycjach początkowych.
th: เข้าป้อมได้ถ้าวางคิงกับรุคไว้ที่ตำแหน่งปกติเท่านั้น

source: You can choose different starting setups including Embassy Chess and Gothic Chess.
de: Du kannst unterschiedliche Startpositionen auswählen, unter anderem Embassy Chess und Gothic Chess.
it: Puoi scegliere diverse posizioni iniziali, incluso gli scacchi gotici ed Embassy Chess.
pl: Możesz wybrać inne ustawienie początkowe, między innymi: Embassy chess, lub szachy gotyckie.
th: เลือกตำแหน่งเริ่มต้นได้หลายแบบ เช่น Embassy หรือ Gothic

source: For a drop version, choose GRANDHOUSE from the dropdown menu.
de: Für eine Version mit Einsetzen, wähle GRANDHOUSE im dropdown Menü.
it: Per una versione con paracadutaggi, seleziona GRANDHOUSE dal menu a tendina.
pl: Możesz wybrać wariant GRANDHOUSE z dostawianiem z rozwijanego menu.
th: ถ้าต้องการเล่นแบบนำหมากที่ถูกกินกลับมาวางได้ มี GRANDHOUSE ให้เลือกจากเมนู

source: For a drop version, choose S-HOUSE from the dropdown menu.
de: Für eine Version mit Einsetzen, wähle S-HOUSE im dropdown Menü.
it: Per una versione con paracadutaggi, seleziona S-HOUSE dal menu a tendina.
pl: Możesz wybrać wariant S-HOUSE z dostawianiem z rozwijanego menu.
th: ถ้าต้องการเล่นแบบนำหมากที่ถูกกินกลับมาวางได้ มี S-HOUSE ให้เลือกจากเมนู

source: The queen actually demotes upon capture, so it is not worth as much.
de: Die Dame wird heruntergestuft wenn sie geschlagen wird, also ist sie nicht so viel wert wie sonst.
it: La Donna viene declassata in un pezzo meno potente dopo aver catturato, dunque non vale quanto negli scacchi standard.
pl: Hetmany są degradowane po biciu, więc nie są warte aż tak dużo.
th: ควีนถูกกินแล้วจะอ่อนแอลง จึงไม่ได้มีค่ามากเท่าไร

source: The cannon is a tricky piece that needs to be closely followed.
de: Die Kanone ist eine trickreiche Figur und sollte im Auge behaltet werden.
it: Il cannone è un pezzo insidioso che deve essere controllato con attenzione.
pl: Armata jest podstępną figurą na którą trzeba uważać.
th: ปืนใหญ่เป็นหมากที่ป่วนพอสมควร ต้องจับตาดูมันให้ดี

source: Other piece sets are available, which may help avoid confusion.
de: Andere Figurensets sind verfügbar, welche eventuell helfen, Verwirrung zu vermeiden.
it: Sono disponibili altri set di pezzi, che potrebbero aiutare a ridurre la confusione con i set originali.
pl: Dostępne są inne zestawy figur pomagające się nie pomylić.
th: มีตัวหมากแบบอื่นให้เลือกใช้ อาจจะช่วยให้แยกจากม้ากับบิชอปธรรมดาง่ายขึ้น

source: Be aware of campmate - victory by moving your king into the 8th rank.
de: Nimm dich vor Eindrungsmatt in Acht - Wenn der König bis zur 8ten Reihe vordringt, ist das Spiel gewonnen.
it: Attento al campomatto - ovvero la vittoria ottenuta muovendo il tuo re nell'ottava traversa.
pl: Pamiętaj o campmacie – zwycięstwie przez dotarcie królem na ostatnią linię.
th: ระวังโดนยึดฐาน เกมนี้สามารถชนะได้ด้วยการเดินคิงไปถึงแถวสุดท้าย

source: Promoting the king prematurely can be dangerous.
de: Es kann gefährlich sein, den König vorzeitig zu befördern
it: Promuovere il re prematuramente può essere pericoloso.
pl: Przedwczesna promocja króla może być ryzykowna.
th: การเลื่อนยศคิงเร็วเกินไปอาจเป็นอันตรายได้

source: Make sure to consider both forms of each piece.
de: Gib jederzeit auf beide Formen einer Figur Acht.
pl: Miej w pamięci obie wersje każdej figury.
th: อย่าลืมพิจารณาตัวหมากแต่ละตัวให้ครบทั้งสองด้าน

source: Spartan kings can be a powerful addition to an offensive.
de: Spartanische Könige können viel zu einem Angriff beitragen.
pl: Spartański król może być istotną pomocą w ataku.
th: สปาร์ตันสามารถใช้คิงเป็นหมากบุกที่ทรงพลังตัวหนึ่ง

source: Maximizing khon and met's effectiveness is the key.
de: Es ist wichtig, den Khon und Met so effektiv wie möglich einzusetzen.
it: Massimizzare l'efficace di Khon e Met è essenziale.
pl: Maksymalizowanie aktywności hetmanów i gońców jest kluczowe.
th: ใช้โคนและเม็ดให้เกิดประสิทธิภาพสูงสุด

source: Watch out for knight checks, since they cannot be blocked.
de: Nimm dich vor Springerschachs in Acht, da diese nicht geblockt werden können.
it: Fai attenzione agli scacchi di cavallo, dato che non possono essere bloccati.
pl: Uważaj na szachy skoczkiem, ponieważ nie da się przed nimi zasłonić.
th: ม้าปิดรุกไม่ได้ ต้องระวังให้ดี

source: You can use placement to utilize your stronger pieces from the start.
de: Mit der Platzierung kanns du stärkere Figuren gleich von Anfang an benutzen.
it: Puoi usare la fase di piazzamento per posizionare i tuoi pezzi più potenti sin dall'inizio.
pl: Możesz ustawić swoje najsilniejsze figury tak, aby wykorzystać je już od pierwszych posunięć.
th: การวางหมากในตำแหน่งใดก็ได้ทำให้หมากใหญ่ขึ้นได้เร็วมาก

source: King safety is important. Use the king leap move to save time.
de: Die Sicherheit des Königs ist wichtig. Nutze den Königssprung um Zeit zu gewinnen.
it: La sicurezza del re è importante. Usa la mossa di salto del re per risparmiare tempo.
pl: Bezpieczeństwo króla jest istotne. Użyj ruchu skoczka, żeby zaoszczędzić czas.
th: ความปลอดภัยของขุนนั้นสำคัญ ใช้สูตรขุนเพื่อประหยัดเวลาได้

source: The ability to promote to rook makes for a dynamic endgame.
de: Die Fähigkeit des Verwandeln zum Turm macht ein dynamisches Endspiel.
it: L'abilità di promuovere a torre permette finali dinamici.
pl: Możliwość promocji na wieżę czyni grę bardziej dynamiczną.
th: การเลื่อนยศเป็นเรือได้ทำให้หมากปลายกระดานเด็ดขาดมากขึ้น

source: Internationalized sets are available by going to settings.
de: Internationale Figurensets sind verfügbar in den Einstellungen.
it: Dei set di pezzi internazionali sono disponibili nelle impostazioni.
pl: Międzynarodowe zestawy figur są dostępne w ustawieniach.
th: มีตัวหมากแบบรูปภาพให้เลือกในการตั้งค่า

source: Despite the simple appearance, there is still quite a bit of depth underlying this game.
de: Trotz des einfachen Aussehens, besitzt dieses Spiel einiges an Tiefe.
it: Nonostante l'apparenza semplice, si tratta di un gioco abbastanza complesso.
pl: Mimo prostego wyglądu, w tej grze jest pewna głębia.
th: ถึงแม้จะดูเรียบง่าย แต่เกมนี้มีแต้มเดินที่ลึกพอสมควร
