Repository: avirtual777/pychess-variants
Catalog: lang/*/LC_MESSAGES/client.po
Languages: de, it, pl, th

source: Makruk using the board/pieces from International Chess as well as pawn promotion rules.
de: Makruk mit Brett, Figuren und Bauernumwandlung aus dem westlichen Schach.
it: Simile al Makruk ma usa scacchiera, pezzi e regole di promozione degli scacchi internazionali.
pl: Makruk z figurami planszą i zasadami promocji jak w standardowych szachach.
th: คล้ายหมากรุกไทย แต่ใช้กระดาน ตัวหมาก และการเลื่อนยศแบบหมากรุกสากล

source: 5x5 Shogi for more compact and faster games. There are no knights or lances.
de: 5x5 Shogi für kompaktere und schnellere Partien. Es gibt keine Springer oder Lanzen.
it: Shogi 5x5 più compatto e con partite più veloci. Non ci sono Cavalli o Lance.
pl: Shogi 5x5 dające szybszą i bardziej zwartą grę. Nie występują skoczki i lance.
th: หมากรุกญี่ปุ่นขนาดเล็ก เล่นบนกระดาน 5x5 เพื่อให้เกมรวดเร็วยิ่งขึ้น

source: A wild Shogi variant on a 5x5 board where pieces flip into a different piece after each move.
de: Eine wilde Shogi Variante auf einem 5x5 Brett, wo Figuren nach jedem Zug zu einer anderen Figur umgedreht werden.
it: Una variante dinamica dello Shogi in cui i pezzi si trasformano dopo ogni mossa, giocata su scacchiera 5x5.
pl: Szalona odmiana Shogi na planszy 5x5, w której figury przemieniają się po każdym ruchu.
th: หมากรุกญี่ปุ่นรูปแบบใหม่ กระดาน 5x5 แต่ตัวหมากพลิกไปพลิกมาทุกครั้งที่เดิน

source: 3x4 game with cute animals, designed to teach children how to play Shogi.
de: Ein 3x4 Spiel mit niedlichen Tieren, entwickelt um Kindern Shogi beizubringen.
it: Gioco 3x4 con animaletti carini, con lo scopo di insegnare ai bambini lo Shogi.
pl: Wariant 3x4 z uroczymi zwierzątkami, zaprojektowany do uczenia dzieci Shogi.
th: เกมหมากรุกสัตว์โลกน่ารักบนกระดาน 3x4 สำหรับสอนเด็กเล็ก

source: 5x6 Shogi designed to introduce tactics with the generals.
de: 5x6 Shogi entwickelt um Taktiken mit den Generälen beizubringen.
it: Shogi 5x6 concepito per introdurre alle tattiche con i generali.
pl: Shogi 5x6 zaprojektowane by wprowadzić kombinacje z udziałem generałów.
th: หมากรุกญี่ปุ่นบนกระดาน 5x6 สำหรับฝึกสอนการใช้ขุนพลเงินและขุนพลทอง

source: A confrontational 7x7 variant with unique pieces each named after different birds.
de: Eine konfrontierende 7x7 Variante mit einzigartigen Figuren benannt nach Vögeln.
it: Una variante movimentata 7x7 con pezzi unici con nomi ispirati ad uccelli.
pl: Konfrontacyjna odmiana 7x7 z unikalnymi figurami nazwanymi od gatunków ptaków.
th: หมากรุกญี่ปุ่นขนาด 7x7 ที่หมากบนกระดานหนาแน่น พร้อมฟาดฟันตลอดเวลา วิธีเดินพิสดารและตัวหมากมีชื่อเป็นนกชนิดต่างๆ

source: Chinese Chess, one of the oldest and most played board games in the world.
de: Chinesisches Schach, eines der ältesten und meist gespielten Brettspiele der Welt.
it: Scacchi cinesi, uno dei giochi più antichi e giocati al mondo.
pl: Szachy chińskie, jedna z najstarszych i najbardziej granych gier planszowych na świecie.
th: หมากรุกจีน หนึ่งในเกมกระดานที่เก่าแก่และยอดนิยมที่สุดในโลก

source: Xiangqi variant where one side has a chariot that can also move as a cannon or horse.
de: Xiangqi Variante wo eine Seite einen Wagen hat, der sich auch wie eine Kanone oder ein Pferd bewegen kann.
it: Variante dello Xiangqi in cui un giocatore ha una torre che può anche muovere come cannone o cavallo.
pl: Odmiana Xiangqi w której jeden z graczy ma rydwan ruszający się także jak działo lub skoczek.
th: หมากรุกจีนรูปแบบหนึ่งที่ฝ่ายสีแดงมีเรือตัวเดียว แต่เดินเป็นม้ากับปืนใหญ่ได้ด้วย

source: Korean Chess, similar to Xiangqi but plays much differently. Tournament rules are used.
de: Koreanisches Schach. Ähnlich wie Xiangqi, spielt sich aber anders. Turnierregeln werden verwendet.
it: Scacchi coreani. Simile allo Xiangqi, ma le partite sono molto diverse. Si usano regole da torneo.
pl: Szachy koreańskie, podobne do Xiangqi, ale istotnie inne. Stosujemy zasady turniejowe.
th: หมากรุกเกาหลี พัฒนาจากหมากรุกจีนแต่เล่นต่างกันมาก

source: Compact version of Xiangqi played on a 7x7 board without a river.
de: Kompakte Version von Xiangqi, gespielt auf einem 7x7 Brett ohne Fluss.
it: Versione compatta dello Xiangqi giocata su una scacchiera 7x7 senza fiume.
pl: Mniejsza wersja Xiangqi na planszy 7x7 bez rzeki.
th: หมากรุกจีนขนาดเล็ก เล่นบนกระดาน 7x7 และไม่มีแม่น้ำ

source: Play with the hybrid pieces, archbishop (B+N) and chancellor (R+N), on a 10x8 board.
de: Spiele mit Hybridfiguren, dem Erzbischof (L+S) und dem Kanzler (T+S), auf einem 10x8 Brett.
it: Gioca con pezzi ibridi, il Cardinale (A+C) e il Maresciallo (T+C), su una scacchiera 10x8.
pl: Graj z figurami hybrydowymi, arcybiskupem (gońcoskoczek) i kanclerzem (wieżoskoczek) na planszy 10x8.
th: เล่นตัวหมากผสม อาร์คบิชอบ (B+N) และชานซเลอร์ (R+N) บนกระดาน 10x8

source: Capablanca with Crazyhouse drop rules.
de: Capablanca mit Crazyhouse-Einsetzregeln.
it: Capablanca con regole Crazyhouse.
pl: Szachy Capablanki z zasadami dostawiania jak w Crazyhouse'ie.
th: Capablanca ที่ใช้กฎการวางหมากแบบ Crazyhouse

source: Hybrid pieces, the hawk (B+N) and elephant (R+N), can enter the board after moving a back rank piece.
de: Hybridfiguren, der Falke (L+S) und der Elefant (T+S), können eingesetzt werden wenn man Figuren von der Grundreihe bewegt.
it: Pezzi ibridi, il Falco (A+C) e l'Elefante (T+C), possono entrare in gioco dopo aver mosso un pezzo dalle traverse di promozione.
pl: Hybrydowe figury: jastrząb (gońcoskoczek) i słoń (wieżoskoczek) mogą wejść na planszę po ruchu figurą z pierwszej linii.
th: หมากผสม เหยี่ยว (B+N) และ ช้าง (R+N) สามารถเข้าสู่กระดานได้หลังจากหมากแถวหลังเดินออกไป

source: S-Chess with Crazyhouse drop rules.
de: S-Chess mit Crazyhouse-Einsetzregeln.
it: Scacchi-S con regole Crazyhouse.
pl: S-chess z zasadami dostawiania jak w Crazyhouse'ie.
th: S-Chess ที่ใช้กฎการวางหมากแบบ Crazyhouse

source: Play with the hybrid pieces, archbishop (B+N) and chancellor (R+N), on a grand 10x10 board.
de: Spiele mit Hybridfiguren, dem Erzbischof (L+S) und dem Kanzler (T+S), auf einem großem 10x10 Brett.
it: Gioca con pezzi ibridi, il Cardinale (A+C) e il Maresciallo (T+C), su una grande scacchiera 10x10.
pl: Graj z figurami hybrydowymi, arcybiskupem (gońcoskoczek) i kanclerzem (wieżoskoczek) na planszy 10x10.
th: เล่นตัวหมากผสม อาร์คบิชอบ (B+N) และชานซเลอร์ (R+N) บนกระดาน 10x10

source: Grand Chess with Crazyhouse drop rules.
de: Grand Chess mit Crazyhouse-Einsetzregeln.
it: Grand Chess con regole Crazyhouse.
pl: Grand z zasadami dostawiania jak w Crazyhouse'ie.
th: Grand Chess ที่ใช้กฎการวางหมากแบบ Crazyhouse

source: Introduces the cannon and elephant from Xiangqi into a 10x10 chess board.
de: Führt die Kanone und den Elefanten von Xiangqi auf einem 10x10 Schachbrett ein.
it: Introduce il Cannone e l'Elefante dallo Xiangqi su una scacchiera 10x10.
pl: Używa działa i słonia z Xiangqi na planszy 10x10.
th: นำปืนใหญ่และช้างจากหมากรุกจีน มาเล่นในกระดานขนาด 10x10

source: Pieces promote and can be dropped, similar to Shogi.
de: Figuren können, wie im Shogi, befördert und eingesetzt werden.
it: I pezzi promuovono e possono essere paracadutati, come nello Shogi.
pl: Figury promują i mogą być dostawiane, podobnie jak w Shogi.
th: มีการเลื่อนยศหมากใหญ่ และสามารถนำหมากที่กินกลับมาวางได้ คล้ายกับหมากรุกญี่ปุ่น

source: Knights capture as bishops; bishops capture as knights.
de: Springer schlagen wie Läufer; Läufer schlagen wie Springer.
it: I cavalli catturano come alfieri, gli alfieri catturano come cavalli.
pl: Skoczki biją jak gońce, gońce jak skoczki.
th: ม้ากินเหมือนบิชอป บิชอปกินเหมือนม้า

source: Asymmetric variant where one army has pieces that move like knights but capture differently.
de: Asymmetrische Variante wo eine Seite Figuren hat, die sich wie Springer bewegen, aber anders schlagen.
it: Variante asimmetrica in cui uno schieramento ha pezzi che muovono come Cavalli ma catturano diversamente.
pl: Asymetryczna odmiana w której jedna strona ma figury ruszające się jak skoczki, ale bijące inaczej.
th: เกมอสมมาตร กองทัพหมากรุกสากล ปะทะ กองทัพมองโกล มีแต่หมากที่เดินเหมือนม้า แต่กินต่างกันออกไป

source: Asymmetric East vs. West variant which pits the western Chess army against a Xiangqi and Janggi-styled army.
de: Asymmetrische "Osten vs. Westen" Variante wo sich eine Schach Armee einer Armee im Stil von Xiangqi/Janggi stellt.
it: Variante asimmetrica "Est contro Ovest" nella quale l'esercito occidentale combatte contro un esercito basato sullo Xiangqi e lo Janggi.
pl: Asymetryczna odmiana Zachód przeciwko Wschodowi zestawiająca standardową armię szachową przeciwko armii wzorowanej na Xiangqi i Janggi.
th: เกมอสมมาตร กองทัพหมากรุกสากล ปะทะ กองทัพหมากรุกจีนและเกาหลี

source: Asymmetric variant which pits the western Chess army against a drop-based, Shogi-styled army.
de: Asymmetrische Variante wo sich eine Schach Armee, einer Armee mit Einsetzen im Stil von Shogi stellt.
it: Variante asimmetrica che fa scontrare uno schieramento degli scacchi occidentali contro uno schieramento basato sullo Shogi e che può paracadutare.
pl: Asymetryczna odmiana zestawiająca standardową armię szachową przeciwko armii z dostawianiem wzorowanej na Shogi.
th: เกมอสมมาตร กองทัพหมากรุกสากล ปะทะ กองทัพนินจาที่หมากกระโดดลงมาจากนอกกระดานได้

source: Asymmetric variant where one army has pieces that move like queens but capture as usual.
de: Asymmetrische Variante wo eine Seite Figuren hat, die sich wie Damen bewegen, aber ansonsten normal schlagen.
it: Variante asimmetrica in cui uno schieramento ha pezzi che muovono come Donne ma catturano normalmente.
pl: Asymetryczna odmiana w której jedna strona ma figury ruszające się jak hetman, ale bijące normalnie.
th: เกมอสมมาตร กองทัพหมากรุกสากล ปะทะ กองทัพจักรวรรดิ หมากทุกตัวเดินเหมือนควีน แต่กินเหมือนหมากปกติ

source: Orda Chess variant with two Horde armies. The Falcon replaces the Yurt.
de: Orda Schach Variante mit zwei Horde Armeen. Der Falke ersetzt den Yurt.
it: Variante Orda con due schieramenti eterodossi. Il Falco rimpiazza la Iurta.
pl: Orda z dwoma armiami Hordy z Sokołem zamiast Jurty.
th: รูปแบบของ Orda ที่เป็นกองทัพมองโกลทั้งสองฝ่าย

source: Mayan chess. Inspired by cultural elements of Mesoamerica.
de: Maya-Schach. Inspiriert von kulturellen Elementen Mesoamerikas.
it: Scacchi maya. Ispirato da elementi culturali del Mesoamerica.
pl: Szachy majańskie, inspirowane kulturą ameryki środkowej.
th: หมากรุกมายัน ได้รับแรงบันดาลใจจากวัฒนธรรมเมโสอเมริกา

source: Pieces alternate between two forms with each move.
de: Figuren wechseln mit jedem Zug ziwschen zwei Formen hin und her.
it: I pezzi alternano tra le due forme con ogni mossa.
pl: Bierki zmieniają swoją postać po każdym ruchu.
th: ตัวหมากเปลี่ยนร่างระหว่างหมากสองแบบทุกครั้งที่เดิน

source: Asymmetric Spartans vs. Persians variant.
de: Asymmetrische Spartaner vs. Persianer Variante.
pl: Asymetryczna odmiana Spartanie vs Persowie
th: กองทัพสปาร์ตันปะทะกองทัพเปอร์เซีย

source: Like Capablanca Chess but with Grand starting setup.
de: Wie Capablanca aber mit der Grand Startposition.
it: Come gli Scacchi Capablanca ma con la posizione iniziale del Grand Chess.
pl: Podobne do szachów Capablanki, ale z innym ustawieniem początkowym.
th: คล้าย Capablanca แต่ใช้ตำแหน่งเริ่มต้นแบบ Grand

source: Embassy with Crazyhouse drop rules.
de: Embassy mit Crazhouse-Einsatzregeln
pl: Embassy z zasadami dostawiania jak w crazyhouse'ie
th: Embassy ที่ใช้กฎการวางหมากแบบ Crazyhouse

source: Like Capablanca Chess but with a different starting setup.
de: Wie Capablanca aber mit einer anderen Startposition.
it: Come gli Scacchi Capablanca ma con una posizione iniziale differente.
pl: Podobne do szachów Capablanki, ale z inną pozycją początkową.
th: คล้าย Capablanca แต่ตำแหน่งเริ่มต้นต่างกัน

source: Gothic with Crazyhouse drop rules.
de: Gothic mit Crazyhouse-Einsetzregeln.
it: Scacchi gotici con regole di paracadutaggio Crazyhouse.
pl: Szachy gotyckie z zasadami dostawiania jak w Crazyhouse'ie.
th: Gothic ที่ใช้กฎการวางหมากแบบ Crazyhouse

source: Host a game for others
de: Eine Partie für andere erstellen
it: Hosta una partita per altri
pl: Utwórz partię dla kogoś innego
th: เปิดห้องให้ผู้อื่นเล่น

source: Challenge to a game
de: Zu einer Partie herausfordern
it: Sfida ad una partita
pl: Zaproś do gry
th: ท้าเล่นเกม

source: CANCEL
de: ABBRECHEN
it: ANNULLA
pl: ANULUJ
th: ยกเลิก

source: Waiting for the other player
de: Auf den Gegner warten
it: In attesa dell'avversario
pl: Oczekiwanie na przeciwnika
th: กำลังรอผู้เล่นอีกคน

source: Sorry, this seat is already occupied
de: Sorry, dieser Platz ist schon besetzt
it: Questo posto è già occupato
pl: Niestety, to miejsce jest już zajęte
th: ขออภัย ที่นั่งนี้มีคนนั่งอยู่แล้ว

source: Sorry, you cannot play with yourself
de: Sorry, du kannst nicht gegen dich selbst spielen
it: Non puoi giocare contro te stesso
pl: Niestety nie możesz zagrać z samym(ą) sobą
th: ขออภัย คุณไม่สามารถเล่นกับตัวเองได้

source: JOIN THE GAME
de: AM SPIEL TEILNEHMEN
it: UNISCITI ALLA PARTITA
pl: DOŁĄCZ DO GRY
th: เข้าร่วมเกม

source: To invite someone to play, give them this URL:
de: Um jemanden einzuladen, gib ihnen diesen Link:
it: Per invitare qualcuno a giocare, invia questo URL:
pl: Zaproś kogoś do gry wysyłając tego linka:
th: เชิญคนเข้ามาเล่นด้วยการส่ง URL นี้ให้:

source: Copy URL
de: URL kopieren
it: Copia URL
pl: Skopiuj URL
th: คัดลอก URL

source: The first two people to come to this URL will play with each other.
de: Die ersten zwei Spieler die den Link anklicken, spielen miteinander.
it: Le prime due persone che cliccheranno questo URL giocheranno tra di loro.
pl: Pierwsze dwie osoby, które wejdą pod ten link zagrają ze sobą.
th: ผู้เล่นสองคนแรกที่เข้ามาที่ URL นี้จะได้เล่นกัน

source: The first person to come to this URL will play with you.
de: Die erste Person, die diese URL aufruft, wird dein Gegner.
it: La prima persona che userà questo URL giocherà con te.
pl: Zagrasz z pierwszą osobą, która wejdzie pod ten URL.
th: คนแรกที่เข้ามาที่ URL นี้จะได้เล่นกับคุณ

source: Play with AI
de: Spiele mit dem Computer
it: Gioca contro il computer
pl: Zagraj z komputerem
th: เล่นกับ AI

source: Play with a friend
de: Mit einem Freund spielen
it: Gioca contro un amico
pl: Zagraj ze znajomym
th: เล่นกับเพื่อน

source: Create a game
de: Spiel erstellen
it: Crea una partita
pl: Utwórz partię
th: สร้างห้อง

source: Challenge %1 to a game
de: %1 zu einem Spiel herausfordern
it: Sfida %1 ad una partita
pl: Zaproś %1 do gry
th: ท้า %1 เล่นเกม

source: Cancel
de: Abbrechen
it: Annulla
pl: Anuluj
th: ยกเลิก

source: Paste the FEN text here
de: FEN Text hier einfügen
it: Incolla il FEN qui
pl: Tu wklej FEN
th: ใส่ FEN ตำแหน่งเริ่มต้นที่นี่

source: (must be signed in)
de: (muss angemeldet sein)
it: (necessario aver effettuato l'accesso)
pl: (musisz się zalogować)
th: (ต้องเข้าสู่ระบบก่อน)

source: Time control
pl: Tempo
th: ประเภทเวลา

source: Real time
pl: Na żywo
th: เวลาจริง

source: Correspondence
pl: Korespondencyjne
th: เวลาจดหมาย

source: Minutes per side:
de: Minuten pro Spieler:
it: Minuti a testa:
pl: Minut na gracza:
th: เวลาทั้งหมด (นาที):

source: Periods
de: Perioden
it: Periodi
pl: Okresy
th: จำนวนรอบ

source: Days per turn:
pl: Dni na ruch
th: เวลาต่อตาเดิน (วัน):

source: Casual
de: Ungewertet
it: Amichevole
pl: Towarzyska
th: ไม่คิดคะแนน

source: Rated
de: Gewertet
it: Classificata
pl: Rankingowa
th: คิดคะแนน

source: Practice with Random-Mover
de: Übe mit dem Zufalls-Zieher
it: Esercitati contro il Random-Mover
pl: Poćwicz z Random-Moverem
th: หัดเล่นกับ Random-Mover

source: A.I. Level
de: K.I. Level
it: Livello
pl: Poziom gry AI
th: ระดับ AI

source: Random
de: Zufällig
it: Casuale
pl: Losowo
th: สุ่ม

source: Create
de: Erstellen
it: Crea
pl: Utwórz
th: สร้าง

source: Byoyomi in seconds:
de: Byoyomi in Sekunden:
it: Byoyomi in secondi:
pl: Byoyomi w sekundach:
th: เบียวโยมิ (วินาที):

source: Increment in seconds:
de: Inkrement in Sekunden:
it: Incremento in secondi:
pl: Czas doliczany w sekundach
th: ทดเวลาต่อตาเดิน (วินาที):

source: Alternate Start
de: Andere Startposition
it: Inizio alternativo
pl: Inna pozycja początkowa
th: ตำแหน่งเริ่มต้นอื่น

source: Invalid FEN
de: Ungültige FEN
it: FEN invalido
pl: Nieprawidłowy FEN
th: FEN ไม่ถูกต้อง

source: Custom
de: Benutzerdefiniert
it: Personalizzato
pl: Niestandardowe
th: กำหนดเอง

source: %1 player
de: %1 Spieler
it: %1 giocatore
pl: %1 gracz
th: %1 คน

source: You have an unfinished game! Press OK to continue.
de: Du hast ein unbeendetes Spiel! Drücke OK um fortzufahren.
it: Hai una partita in corso! Clicca OK per continuarla.
pl: Jesteś w trakcie innej partii. Kliknij OK aby kontynuować
th: คุณมีเกมที่ยังเล่นไม่จบอยู่! กด OK เพื่อไปต่อ

source: %1 game in play
de: %1 laufende Partie
it: %1 partita in corso
pl: %1 partia w trakcie
th: %1 เกมที่กำลังเล่น

source: Tournament calendar
de: Turnierkalender
it: Calendario tornei
pl: Harmonogram turniejów
th: ปฏิทินการแข่งขัน

source: Player
de: Spieler
it: Giocatore
pl: Gracz
th: ผู้เล่น

source: Rating
de: Wertungszahl
it: Punteggio
pl: Ranking
th: คะแนน

source: Time
de: Zeit
it: Tempo
pl: Tempo
th: เวลา

source: Mode
de: Modus
it: Modalità
pl: Rodzaj
th: รูปแบบการเล่น

source: Puzzle of the day
de: Puzzle des Tages
pl: Zadanie dnia
th: หมากกลวันนี้

source: %1 to play
de: %1 am Zug
it: %1 muove
pl: %1 na posunięciu
th: ตา%1เดิน

source: Donate
de: Spenden
it: Fai una donazione
pl: Wesprzyj
th: บริจาค

source: Stats
de: Statistiken
it: Statistiche
pl: Statystyki
th: สถิติ

source: About
de: Über
it: Info
pl: O nas
th: เกี่ยวกับ

source: Thank you for your support!
de: Danke für deine Unterstützung!
it: Grazie per il tuo supporto!
pl: Dziękujemy za wsparcie!
th: ขอบคุณสำหรับการสนับสนุน!

source: No notifications.
pl: Nie masz żadnych powiadomień
th: ไม่มีการแจ้งเตือนใหม่

source: Invalid PGN
de: Ungültige PGN
it: PGN invalido
pl: Nieprawidłowy PGN
th: PGN ไม่ถูกต้อง

source: Paste the PGN text here
de: PGN Text hier einfügen
it: Incolla il PGN qui
pl: Tu wklej PGN
th: วาง PGN ที่นี่

source: IMPORT GAME
de: Spiel importieren
it: IMPORTA PARTITA
pl: WGRAJ PARTIĘ
th: นำเข้าเกม

source: %1 move
de: %1 Zug
it: %1 mossa
pl: %1 ruch
th: %1 ตา

source: Computer analysis available
de: Computer-Analyse verfügbar
it: Analisi del computer disponibile
pl: Dostępna analiza komputerowa
th: มีการวิเคราะห์โดยคอมพิวเตอร์

source: Games
de: Spiele
it: Partite
pl: Partie
th: เกมทั้งหมด

source: Games with you
de: Partien mit dir
it: Partite con te
pl: Partie z Tobą
th: เกมที่เล่นกับคุณ

# UsePluralFormIfNeeded
source: Rated
de: Gewertet
it: Classificata
pl: Rankingowe
th: คิดคะแนน

# UsePluralFormIfNeeded
source: Playing
pl: W trakcie
th: กำลังเล่นอยู่

source: Imported
de: Importiert
it: Importate
pl: Wgrane
th: นำเข้ามา

source: Block
pl: Zablokuj

source: Unblock
pl: Odblokuj

source: LOGIN
pl: ZALOGUJ SIĘ
th: เข้าสู่ระบบ

source: Hint
de: Hinweis
pl: Wskazówka
th: บอกใบ้

source: View the solution
de: Lösung ansehen
it: Vedi la soluzione
pl: Zobacz rozwiązanie
th: ดูเฉลย

source: Your puzzle rating will not change. Note that puzzles are not a competition. Ratings help select the best puzzles for your current skill.
de: Deine Aufgabenwertung wird sich nicht ändern. Beachte, dass Aufgaben kein Wettbewerb sind. Deine Wertung hilft, die geeignetsten Aufgaben für deine aktuelle Spielstärke auszuwählen.
pl: Twój ranking w rozwiązywaniu zadań nie ulegnie zmianie. Pamiętaj, że zadania nie są rywalizacją. Twój ranking pomaga wybrać najlepsze zadania dla Twoich aktualnych umiejętności.
th: คะแนนหมากกลของคุณจะไม่เปลี่ยน ทั้งนี้ หมากกลไม่ต้องแข่งกับใคร แต่มีคะแนนไว้เพื่อช่วยเลือกโจทย์ให้เหมาะสมกับทักษะของคุณเท่านั้น

source: Puzzle
pl: Zadanie
th: หมากกล

source: Rating:
de: Wertungszahl:
pl: Ranking
th: คะแนน:

source: hidden
de: verborgen
pl: ukryty
th: ยังไม่เปิดเผย

source: Played:
de: Gespielt:
pl: Rozwiązywane:
th: ถูกเล่นไปแล้ว:

source: Source:
de: Von:
pl: Źródło:
th: ที่มา:

source: Type:
de: Typ:
pl: Rodzaj
th: ประเภท:

source: Your turn
de: Du bist am Zug
it: Il tuo turno
pl: Twój ruch
th: ตาคุณเดิน

source: Find the best move for %1.
de: Finde den besten Zug für %1.
it: Trova la mossa migliore per il %1.
pl: Znajdź najlepszy ruch.
th: เล่นฝ่าย%1 หาตาที่ดีที่สุด

source: That's not the move!
de: Das ist nicht der Zug!
it: Non è questa la mossa!
pl: To nie jest właściwy ruch!
th: ไม่ใช่แบบนั้น

source: Try something else.
de: Versuche etwas anderes.
it: Prova qualcos'altro.
pl: Spróbuj czegoś innego.
th: ลองอย่างอื่นดู

source: Best move!
de: Bester Zug!
it: La mossa migliore!
pl: Najlepszy ruch!
th: ยอดเยี่ยม

source: Keep going...
de: Mach weiter...
it: Continua...
pl: Kontynuuj…
th: เดินต่อไป...

source: Success!
de: Korrekt!
pl: Sukces!
th: สำเร็จ!

source: Puzzle complete!
de: Puzzle geschafft!
it: Puzzle completato!
pl: Sukces!
th: เสร็จสิ้น

source: Did you like this puzzle?
de: Gefällt dir dieses Puzzle?
pl: Podoba Ci się to zadanie?
th: คุณชอบหมากกลนี้หรือไม่?

source: Vote to load the next one!
de: Abstimmen um zur nächsten Aufgabe zu gelangen
pl: Zagłosuj a dostaniesz następne
th: ให้คะแนนแล้วไปข้อต่อไป

source: Continue training
de: Training fortsetzen
it: Continua ad allenarti
pl: Kontynuuj trening
th: ดูข้อนี้ต่อ

source: Jump to next puzzle immediately
de: Sofort zur nächsten Aufgabe springen
pl: Automatycznie przejdź do następnego zadania
th: ไปข้อต่อไปอัตโนมัติ

source: IMPORT
de: IMPORTIEREN
it: IMPORTA
pl: WGRANA
th: นำเข้า

source: level %1
de: niveau %1
it: livello %1
pl: Poziom %1
th: ระดับ %1

source: Game aborted
de: Partie abgebrochen
it: Partita annullata
pl: Partia została przerwana
th: เกมถูกยกเลิก

source: Checkmate
de: Schachmatt
it: Scacco matto
pl: Mat
th: รุกจน

source: %1 resigned
de: %1 hat aufgegeben
it: %1 ha abbandonato
pl: %1 poddały się
th: %1ยอมแพ้

source: Stalemate
de: Patt
it: Stallo
pl: Pat
th: อับ

source: Time out
de: Zeit abgelaufen
it: Tempo scaduto
pl: Przekroczenie czasu
th: หมดเวลา

source: Draw
de: Remis
it: Patta
pl: Remis
th: เสมอ

source: %1 abandoned the game
de: %1 hat das Spiel verlassen
it: %1 ha lasciato la partita
pl: %1 porzuciły partię
th: %1ละทิ้งเกม

source: Cheat detected
de: Betrug entdeckt
it: Baro rilevato
pl: Wykryto oszustwo
th: ตรวจพบการโกง

source: Not started
de: Nicht gestartet
it: Non iniziato
pl: Nierozpoczęta
th: เกมไม่เริ่ม

source: Invalid move
de: Ungültiger Zug
it: Mossa invalida
pl: Niedozwolony ruch
th: เดินผิดกติกา

source: Unknown reason
de: Unbekannter Grund
it: Ragione sconosciuta
pl: Nieustalony powód
th: ไม่ทราบสาเหตุ

source: Altar mate
de: Altarmatt
it: Matto d'altare
pl: Zdobycie ołtarza
th: ยึดแท่นบูชา

source: Explosion of king
de: Explosion des Königs
it: Esplosione del re
pl: Wysadzenie króla
th: คิงระเบิด

source: King in the center
pl: Król w centrum
th: คิงเข้าถึงกลางกระดาน

source: Three checks
pl: Trzeci szach
th: รุกครบสามครั้ง

source: King captured
de: König geschlagen
pl: Zbicie króla
th: คิงถูกกิน

source: Point counting
de: Punkte zählen
it: Conta dei punti
pl: Rozstrzygnięcie na punkty
th: นับคะแนน

source: Repetition
de: Wiederholung
it: Ripetizione
pl: Powtórzenie pozycji
th: ตำแหน่งหมากซ้ำ

source: %1 won
pl: %1 wygrały

source: +15 seconds
de: +15 Sekunden
it: +15 secondi
pl: +15 sekund
th: +15 วินาที

source: Give 15 seconds
de: Gebe 15 Sekunden
it: Concedi 15 secondi
pl: Dodaj 15 sekund
th: เพิ่มให้ 15 วินาที

source: Count
de: Abzählen
it: Conta
pl: Odliczaj
th: นับ

source: Pass
de: Aussetzen
it: Passa
pl: Pas
th: ผ่าน

source: Resign
de: Aufgeben
it: Abbandona
pl: Poddaj się
th: ยอมแพ้

source: Abort
de: Abbrechen
it: Annulla
pl: Przerwij partię
th: ยกเลิก

source: Are you sure you want to draw?
de: Bist du sicher, dass du Remis anbieten willst?
it: Vuoi veramente pattare?
pl: Na pewno chcesz zaproponować/przyjąć remis?
th: ต้องการเสมอจริงหรือไม่?

source: Draw offer sent
de: Remisangebot gesendet
it: Offerta di patta inviata
pl: Zaproponowałeś(aś) remis
th: ส่งคำขอเสมอแล้ว
