Repository: avirtual777/pychess-variants
Catalog: lang/*/LC_MESSAGES/client.po
Languages: de, it, pl, th

source: "To me, how we've got here today is owing to Stockfish in a BIG way. They rallied global volunteers to come together in the open-source spirit and create such a powerful engine for FREE. That's a lot of great minds and computing power they've managed to harness.
de: "Wie wir heute hierher gekommen sind, verdanken wir Stockfish in hohem Maße. Sie haben weltweit Freiwillige zusammengetrommelt, die sich im Open-Source-Geist zusammengetan haben, um eine so leistungsstarke Engine kostenlos zu erstellen. Das sind eine Menge großartiger Köpfe und eine Menge Rechenleistung, die sie sich zunutze machen konnten.
it: "Secondo me, dobbiamo MOLTO a Stockfish per i traguardi raggiunti. Hanno reclutato volontari da tutto il mondo per unire le forze nello spirito dell'open-source e hanno creato un motore così potente GRATIS. Sono riusciti a raccogliere un sacco di grandi menti e potenza di potenza di calcolo.
pl: "Według mnie, to gdzie jesteśmy dzisiaj zawdzięczamy w ogromnym stopniu Stockfishowi. Mnóstwo ludzi z całego świata zgromadziło się w duchu open-source i stworzyło tak potężny silnik ZA DARMO. Wykorzystali do tego wiele potężnych umysłów i mnóstwo mocy obliczeniowej.
th: "สำหรับผมแล้ว การที่เรามาถึงจุดนี้ได้ต้องขอบคุณ Stockfish เป็นอย่างยิ่ง เขาได้รวบรวมอาสาสมัครจากทั่วทุกมุมโลกให้มาชุมนุมกันด้วยจิตวิญญาณโอเพนซอร์สและสร้างสรรค์เอ็นจินที่ทรงพลังให้ใช้กันฟรีๆ สิ่งที่เขาสามารถรวบรวมมาได้นั้นเป็นทั้งมันสมองอันยิ่งใหญ่และพลังการคำนวณมากมาย

source: Then we've got Lichess to thank. Lichess was also born out of the same open-source spirit, and it too drew in great people as well. Once Lichess incorporated Stockfish as its brains, the rest is history.
de: Dann haben wir Lichess zu danken. Lichess entstand ebenfalls aus einem Open-Source-Geist und zog großartige Menschen an. Als Lichess Stockfisch als Gehirn integriert hatte, war der Rest Geschichte.
it: Dopodiché, dobbiamo ringraziare Lichess. Anche Lichess è nato dallo stesso spirito dell'open-source e anch'esso ha attratto persone fantastiche. Una volta che Lichess incorporò Stockfish come suo cervello, il resto divenne storia.
pl: Następnie musimy podziękować Lichessowi. Lichess również powstał w tym samym duchu open-source i przyciągnął do siebie wielu wspaniałych ludzi. Później lichess zaczął używać Stockfisha jako swojego mózgu, a resztę historii wszyscy znamy.
th: หลังจากนั้น เราก็ต้องขอบคุณ Lichess ด้วยเช่นกัน Lichess ก็ถือกำเนิดจากจิตวิญญาณโอเพนเซอร์สแบบเดียวกัน และดึงดูดบุคคลที่ยิ่งใหญ่เข้ามาร่วมเช่นกัน เมื่อลิเชสรวมสต็อกฟิชมาเป็นมันสมอง เรื่องราวที่เหลือก็เป็นอย่างที่เรารู้กัน

source: Lichess enables the online, real-time, and competitive aspects of game-play. They also bring the enormous power of Stockfish to the masses, who can now benefit from it without configuring a local GUI. I believe this development turns out to be of great consequence and significance.
de: Lichess ermöglicht die Online-, Echtzeit- und kompetitiven Aspekte des Spielens. Sie bringen auch die enorme Leistung von Stockfish zu den Massen, die nun davon profitieren können, ohne eine lokale GUI zu konfigurieren. Ich glaube, dass diese Entwicklung sich als von großer Tragweite und Bedeutung erweisen wird.
it: Lichess permette gli aspetti online, competitivi e in tempo reale del game-play. Portano inoltre l'enorme potenza di Stockfish al servizio delle masse, che possono ora beneficiarne senza configurare un'interfaccia grafica. Credo che questo fattore in particolare sia particolarmente rilevante e abbia grandi conseguenze.
pl: Lichess umożliwia rywalizację online w czasie rzeczywistym. Daje też powszechny dostęp do ogromnej mocy Stockfisha ludziom, którzy mogą korzystać z niego bez potrzeby konfigurowania GUI lokalnie. W mojej jest to coś wyjątkowo znaczącego.
th: Lichess ช่วยให้ผู้คนสามารถแข่งขันหมากรุกออนไลน์แบบเวลาจริง พวกเขานำพลังอันมหาศาลของสต็อกฟิชมาสู่มหาชนซึ่งตอนนี้ได้ใช้ประโยชน์โดยไม่ต้องเสียเวลากับการตั้งค่าโปรแกรมหน้าจอคอมพิวเตอร์ ผมเชื่อว่าพัฒนาการเช่นนี้นำไปสู่ผลลัพธ์ที่ยอดเยี่ยมและสำคัญยิ่ง

source: Later on, developers close to the Lichess project eventually extended Stockfish into Multivariant-Stockfish, in order to support Crazyhouse et al. The father of Fairy-Stockfish, Fabian, is also one of those devs (still) working on that fork, and he later took several steps further in terms of variant support and extensibility. Thus Fairy-Stockfish was born, so powerful because it builds on the Stockfish project.
de: Später haben Entwickler, die dem Lichess-Projekt nahestehen, Stockfish schließlich zu Multivariant-Stockfish erweitert, um Crazyhouse und Co. zu unterstützen. Der Vater von Fairy-Stockfish, Fabian, ist auch einer der Entwickler, die (noch) an diesem Fork arbeiten, und er ist später einige Schritte weiter gegangen, was Variantenunterstützung und Erweiterbarkeit angeht. So wurde Fairy-Stockfish geboren, so mächtig, weil es auf dem Stockfish-Projekt aufbaut.
it: Più tardi, degli sviluppatori vicini al progetto Lichess ampliarono le capacità di Stockfish fino a farlo diventare Stockfish-Multivariante, per supportare Crazyhouse e altre varianti. Il pafre di Fairy-Stockfish, Fabian, è anche io di quei sviluppatori che lavorano (ancora) su quel fork, e che poi sviluppò ulteriormente in termini di supporto ed estensibilità. E dunque nacque Fairy-Stockfish, così potente proprio perché fondato sul progetto Stockfish.
pl: Później deweloperzy blisko związani z Lichess rozszerzyli Stockfisha do Multivariant-Stockfisha wspierającego crazyhouse'a i inne warianty. Twórca Fairy-Stockfisha, Fabian, jest jednym z nich i wciąż pracuje nad tym forkiem, ale później poszedł dalej w stronę obsługiwania coraz większej liczby wariantów i łatwej rozszerzalności. Tak oto narodził się Fairy-Stockfish, który jest tak potężny ponieważ opiera się na Stockfishu.
th: ต่อมา นักพัฒนาโปรแกรมที่ใกล้ชิดกับโครงการ Lichess ได้ขยายความสามารถของ Stockfish ไปเป็น Multivariant-Stockfish เพื่อรองรับเกมหมากรุกชนิดอื่น เช่น Crazyhouse หลังจากนั้น ฟาเบียน หนึ่งในนักพัฒนา ได้เพิ่มความสามารถในแง่ของการรองรับชนิดเกมหมากรุกต่างๆ ให้หลากหลายยิ่งขึ้นไปอีก และได้ให้กำเนิด Fairy-Stockfish อันทรงพลัง ต่อยอดมาจากโครงการ Stockfish

source: Then comes our beloved pychess-variants, which again very smartly harnesses the underlying superpowers of the big projects. Same online, real-time, and competitive aspects. Same clean and familiar Lichess look and feel. Plus the power of Stockfish!"
de: Dann kommen unsere geliebten Pychess-Varianten, die wiederum die zugrunde liegenden Superkräfte der großen Projekte sehr geschickt nutzen. Gleiche Online-, Echtzeit- und Wettbewerbsaspekte. Gleiches sauberes und vertrautes Lichess-Erscheinungsbild. Plus die Kraft von Stockfish!“
it: Infine c'è il nostro amato pychess-variants, che ancora una volta raccogie in maniera motlo intelligente i superpoteri nascosti dei grandi progetti. Stessi aspetti online, competitivi ed in tempo reale. Stessa presentazione familiare, pulita e chiara di Lichess. Più la forza di Stockfish!"
pl: Potem pojawia się nasz ukochany pychess-variants, który również w bardzo sprytny sposób korzysta z leżących u podstaw supermocy wielkich projektów. Taka sama rywalizacja online w czasie rzeczywistym. Taki sam czysty, znajomo wyglądający interfejs jak na Lichess. Plus ogromna moc Stockfisha!"
th: จากนั้น ก็มาถึง pychess-variants อันเป็นที่รักยิ่งของเรา ซึ่งใช้งานพลังมหาศาลจากโครงการใหญ่เหล่านั้นอย่างชาญฉลาด ทั้งการแข่งขันหมากรุกออนไลน์แบบเวลาจริง ทั้งรูปลักษณ์ที่สะอาดตาและให้อารมณ์ที่คุ้นชินอย่าง Lichess ทั้งพลังคำนวณอันสุดยอดของ Stockfish!"

source: About pychess
de: Über pychess
it: Informazioni su pychess
pl: O pychess
th: เกี่ยวกับ pychess

source: Pychess is a free, open-source chess server designed to play several chess variants.
de: Pychess ist ein kostenloser Open-Source-Schachserver, mit dem verschiedene Schachvarianten gespielt werden können
it: Pychess è un server gratis ed open-source progettato per giocare diverse varianti degli scacchi.
pl: Pychess to darmowy serwer szachowy o otwartym kodzie źródłowym, przeznaczony do gry w kilka odmian szachów.
th: Pychess เป็นเซอร์เวอร์หมากรุกฟรีและโอเพนซอร์สที่ถูกออกแบบให้สามารถเล่นเกมหมากรุกได้หลากหลายชนิด

source: Currently supported games are
de: Derzeit unterstützte Spiele sind
it: I giochi supportati al momento sono
pl: Aktualnie dostępne są następujące odmiany:
th: เกมที่รองรับในปัจจุบัน ได้แก่

source: Chess960 castling rules.
de: Schach960 Rochade Regeln
it: Regole di arrocco degli Scacchi960
pl: zasadami roszowania jak w szachach 960.
th: กฎการเข้าป้อมแบบ Chess960

source: For move generation, validation, analysis, and engine play, we use
de: Für die Zuggeneration, Validierung, Analyse und das Spielen mit dem Computer verwenden wir
it: Per la generazione di mosse, validazione, analisi e gioco con motore, usiamo
pl: Do generowania ruchów, sprawdzania poprawności, analizy oraz gry z komputerem używamy:
th: สำหรับการสร้างตาเดิน การทวนสอบ การวิเคราะห์ และการเดินหมากของคอมพิวเตอร์นั้น เราใช้

source: On client side, the user interface of the game board is based on
de: Auf der Client Seite basiert die Benutzeroberfläche auf
it: Sul client-side, l'interfaccia utente della scacchiera è basata su
pl: Interfejs po stronie użytkownika jest oparty na
th: ในฝั่งผู้ใช้งาน ส่วนติดต่อผู้ใช้ของกระดานมีพื้นฐานมาจาก

source: The source code of the server is available on
de: Der Quellcode des Servers ist verfügbar auf
it: Il codice sorgente del server è disponibile su
pl: Kod źródłowy serwera jest dostępny na
th: ซอร์สโค้ดของเว็บไซต์นี้สามารถดูได้ที่

source: To play on PyChess, you need to have an open and unmarked account on Lichess.
de: Um auf PyChess spielen zu können benötigst du ein offenes und unmarkiertes Lichess Konto.
it: Per giocare su PyChess, hai bisogno di un account su Lichess.
pl: Żeby grać na PyChessie musisz mieć otwarte i nieoznaczone konto na Lichessie.
th: ในการที่จะเล่นบน PyChess ได้ คุณจะต้องมีบัญชี Lichess ที่เปิดอยู่และไม่ถูกห้ามเล่นที่นั่น

source: Regarding Privacy and Terms of Service, the rules of lichess.org are also applied here.
de: Bezüglich der Privatsphäre und den Nutzungsbedingungen, gelten die Richtlinien von lichess.org.
it: Per quanto riguarda la Privacy ed i Termini di servizio, le regole di lichess.org si applicano anche qui.
pl: W kwestiach prywatności i zasad użytkowania obowiązują zasady takie jak na lichess.org.
th: สำหรับความเป็นส่วนตัว และข้อกำหนดในการให้บริการนั้น ที่นี่ใช้กฎเดียวกับ lichess.org

source: Variant
de: Variante
it: Variante
pl: Odmiana
th: ชนิดเกม

source: Computer analysis
de: Computer-Analyse
it: Analisi del computer
pl: Analiza komputerowa
th: การวิเคราะห์โดยคอมพิวเตอร์

source: Move times
de: Zug Zeiten
it: Tempo per mossa
pl: Tempo gry
th: เวลาที่ใช้เดิน

source: Crosstable
de: Tabelle
pl: Wyniki spotkań
th: ประวัติผลการเล่น

source: Multi-threaded WebAssembly (classical evaluation)
de: Multi-threaded WebAssembly (klassische Evaluierung)
it: Multi-threaded WebAssembly (valutazione classica)
pl: Wielowątkowy WebAssembly z klasyczną oceną pozycji
th: WebAssembly แบบหลายเธรด (คิดคะแนนแบบธรรมดา)

source: in local browser
de: im lokalen Browser
it: nel browser locale
pl: lokalnie w przeglądarce
th: ในเบราเซอร์ภายในเครื่อง

source: Initial position
de: Anfangsposition
it: Posizione iniziale
pl: Pozycja wyjściowa
th: ตำแหน่งเริ่มต้น

source: Advantage
de: Vorteil
it: Vantaggio
pl: Przewaga
th: ความได้เปรียบ

source: You need an account to do that.
de: Du brauchst einen Account um das zu tun.
it: Hai bisogno di un account per questo.
pl: Aby to zrobić zaloguj się.
th: จำเป็นต้องเข้าสู่ระบบ

source: Download game to PGN file
de: Partie als PGN Datei herunterladen
it: Scarica la partita in PGN
pl: Pobierz partię w formacie PGN
th: ดาวน์โหลดเกมนี้เป็นไฟล์ PGN

source: Download PGN
de: PGN herunterladen
it: Scarica PGN
pl: Pobierz PGN
th: ดาวน์โหลด PGN

source: Copy USI/UCI to clipboard
de: USI/UCI in die Zwischenablage kopieren
it: Copia USI/UCI negli appunti
pl: Skopiuj UCI/USI do schowka
th: คัดลอก USI/UCI ไปยังคลิปบอร์ด

source: Copy UCI/USI
de: UCI/USI kopieren
it: Copia UCI/USI
pl: Skopiuj UCI/USI
th: คัดลอก UCI/USI

source: Download position to PNG image file
de: Stellung als PNG Bild Datei herunterladen
it: Scarica la posizione in un file immagine PNG
pl: Pobierz pozycję jako grafikę PNG
th: ดาวน์โหลดตำแหน่งหมากเป็นไฟล์ภาพ PNG

source: PNG image
de: PNG Bild
it: Immagine PNG
pl: Grafika PNG
th: ภาพ PNG

source: Are you sure you want to delete this game?
de: Bist du sicher, dass du diese Partie löschen möchtest?
it: Sicuro di volere eliminare questa partita?
pl: Na pewno chcesz usunąć tę partię?
th: ต้องการลบเกมนี้จริงหรือไม่?

source: Delete game
de: Partie löschen
it: Elimina la partita
pl: Usuń partię
th: ลบเกม

source: Request Computer Analysis
de: Computer-Analyse anfordern
it: Richiedi Analisi del Computer
pl: Poproś o analizę komputerową
th: ขอการวิเคราะห์จากคอมพิวเตอร์

source: Request Analysis
de: Analyse anfordern
it: Richiedi Analisi
pl: Poproś o analizę
th: ขอการวิเคราะห์

source: Try browser page reload.
de: Versuche die Seite neu zu laden.
it: Prova a ricaricare la pagina
pl: Spróbuj odświeżyć stronę.
th: กรุณาลองรีเฟรชหน้าเว็บ

source: Multi-threaded WebAssembly (with NNUE evaluation)
de: Multi-threaded WebAssembly (mit NNUE Evaluierung)
it: Multi-threaded WebAssembly (con valutazione NNUE)
pl: Wielowątkowy WebAssembly z oceną pozycji NNUE
th: WebAssembly แบบหลายเธรด (คิดคะแนนด้วย NNUE)

source: Depth
de: Tiefe
it: Profondità
pl: Głębokość
th: ความลึก

source: Go deeper
de: Tiefe erhöhen
it: Aumenta la profondità
pl: Głębsza analiza
th: ลึกกว่านี้

source: Best move arrow
de: Pfeil für besten Zug
pl: Strzałka najlepszego ruchu
th: ลูกศรแนะนำตาเดิน

source: Infinite analysis
de: Endlose Analyse
pl: Nieograniczona analiza
th: ถอดหมากแบบไม่รู้จบ

source: Multiple lines
de: Mehrere Varianten
pl: Podawane warianty
th: จำนวนเส้นทาง

source: CPUs
pl: Rdzenie
th: หน่วยประมวลผล

source: Memory
pl: Użycie pamięci
th: หน่วยความจำ

source: Use NNUE
pl: NNUE
th: ใช้ NNUE

source: Light
de: Hell
it: Chiaro
pl: Jasne
th: สว่าง

source: Dark
de: Dunkel
it: Scuro
pl: Ciemne
th: มืด

source: Piece animation
de: Figuren Animation
it: Animazione pezzi
pl: Animacja ruchów
th: การเคลื่อนไหวตัวหมาก

source: Confirm resigning
de: Bestätige Resignation
pl: Potwierdzaj poddanie się
th: ยืนยันก่อนยอมแพ้

source: Confirm correspondence move
pl: Potwierdzanie ruchów w partiach korespondencyjnych
th: ยืนยันก่อนการเดินในเกมจดหมาย

source: Zoom
pl: Powiększenie
th: ขนาดกระดาน

source: Show piece destinations
de: Zielfelder markieren
it: Mostra le mosse possibili
pl: Pokazuj możliwe ruchy
th: แสดงตาที่สามารถเดินได้

source: Promote to the top choice automatically
de: Automatisch zur stärksten Figur umwandeln
it: Promuovi a pezzo "di prima scelta" automaticamente
pl: Automatyczna promocja na najsilniejszą figurę
th: เลื่อนยศเป็นตัวเลือกบนสุดอัตโนมัติ

source: Show material difference
de: Zeige materiellen Unterschied
it: Mostra la differenza di materiale
pl: Pokazuj przewagę materialną
th: แสดงความต่างศักดิ์หมาก

source: Sign in to chat
de: Einloggen um zu chatten
it: Registrati per chattare
pl: Zaloguj się aby uzyskać dostęp do czatu
th: เข้าสู่ระบบเพื่อเริ่มแชต

source: Please be nice in the chat!
de: Bitte sei freundlich im Chat!
it: Sii educato in chat!
pl: Bądź miły/a na czacie
th: กรุณาสนทนาอย่างสุภาพ

source: Chat is disabled
de: Chat ist deaktiviert
it: La chat è disabilitata
pl: Czat wyłączony
th: ห้องแชตถูกปิดอยู่

source: Spectator room
de: Zuschauerraum
it: Sala spettatori
pl: Czat dla widzów
th: ห้องผู้ชม

source: Chat room
de: Chat Raum
pl: Czat
th: ห้องแชต

source: Toggle the chat
de: Chat ein-/ausblenden
it: Attiva/disattiva la chat
pl: Włącz/wyłącz czat
th: เปิด/ปิดแชต

source: Server
pl: Serwer
th: เซิร์ฟเวอร์

source: %1 day
pl: %1 doba
th: %1 วัน

source: %1 hour
pl: %1 godzina
th: %1 ชั่วโมง

source: in %1 year
de: in %1 Jahr
it: fra %1 anno
pl: za rok
th: ในอีก %1 ปี

source: %1 year ago
de: Vor %1 Jahr
it: %1 anno fa
pl: rok temu
th: %1 ปีที่แล้ว

source: in %1 month
de: in %1 Monat
it: tra %1 mese
pl: za miesiąc
th: ในอีก %1 เดือน

source: %1 month ago
de: Vor %1 Monat
it: %1 mese fa
pl: miesiąc temu
th: %1 เดือนที่แล้ว

source: in %1 week
de: in %1 Woche
it: tra %1 settimana
pl: za tydzień
th: ในอีก %1 สัปดาห์

source: %1 week ago
de: Vor %1 Woche
it: %1 settimana fa
pl: tydzień temu
th: %1 สัปดาห์ที่แล้ว

source: in %1 day
de: in %1 Tag
it: tra %1 giorno
pl: za dobę
th: ในอีก %1 วัน

source: %1 day ago
de: Vor %1 Tag
it: %1 giorno fa
pl: dobę temu
th: %1 วันที่แล้ว

source: in %1 hour
de: in %1 Stunde
it: tra %1 ora
pl: za godzinę
th: ในอีก %1 ชั่วโมง

source: %1 hour ago
de: Vor %1 Stunde
it: %1 ora fa
pl: godzinę temu
th: %1 ชั่วโมงที่แล้ว

source: in %1 minute
it: tra %1 minuto
pl: za minutę
th: ในอีก %1 นาที

source: %1 minute ago
de: Vor %1 Minute
it: %1 minuto fa
pl: minutę temu
th: %1 นาทีที่แล้ว

source: in %1 second
de: in %1 Sekunde
it: tra %1 secondo
pl: za sekundę
th: ในอีก %1 วินาที

source: %1 second ago
de: Vor %1 Sekunde
it: %1 secondo fa
pl: sekundę temu
th: %1 วินาทีที่แล้ว

source: Spectators:
de: Zuschauer:
it: Spettatori:
pl: Widzowie:
th: ผู้ชม:

source: Requested game %1 not found!
de: Gesuchte Partie %1 nicht gefunden!
it: Partita richiesta %1 non trovata!
pl: Szukana partia %1 nie została znaleziona!
th: หาเกม %1 ไม่พบ!

source: Playing right now
de: Partie läuft
it: In corso
pl: W trakcie gry
th: กำลังเล่นอยู่

source: White
de: Weiß
it: Bianco
pl: Białe
th: ขาว

source: Black
de: Schwarz
it: Nero
pl: Czarne
th: ดำ

source: Red
de: Rot
it: Rosso
pl: Czerwone
th: แดง

source: Blue
de: Blau
it: Blu
pl: Niebieskie
th: น้ำเงิน

source: Gold
it: Oro
pl: Złote
th: ทอง

source: Pink
it: Rosa
pl: Różowe
th: ชมพู

source: Green
de: Grün
it: Verde
pl: Zielone
th: เขียว

source: chess
de: Schach
it: scacchi
pl: szachy
th: หมากรุกสากล

source: atomic
pl: atomowe

source: shogi
pl: szogi
th: หมากรุกญี่ปุ่น

source: minishogi
pl: miniszogi

source: kyoto shogi
pl: kioto szogi

source: tori shogi
pl: tori szogi

source: s-chess
pl: s-szachy

source: shogun
pl: szogun

source: synochess
pl: synoszachy

source: empire
de: Imperium
pl: imperium

source: orda mirror
pl: symetryczna orda

source: PawnsPushed
de: Bauern vorgezogen
it: PedoniSpinti
pl: Pionki na 4-tej linii
th: เบี้ยประชัน

source: PawnsPassed
de: Bauern vorbeigezogen
it: PedoniPassati
pl: Pionki na 5-tej linii
th: เบี้ยเลย

source: UpsideDown
de: Kopfüber
it: SottoSopra
pl: Odwrócone
th: กลับหัว

source: Theban
de: Thebäisch
it: Tebano
pl: Tebańskie
th: ศึกแห่งธีบส์

source: No castle
de: Ohne Rochade
it: Niente arrocco
pl: Bez roszad
th: ไม่มีเข้าป้อม

source: Lance HC
de: Lanzen Vorgabe
it: Handicap Lancia
pl: Lanca forów
th: ลดหอก

source: Bishop HC
de: Läufer Vorgabe
it: Handicap Alfiere
pl: Goniec forów
th: ลดบิชอป

source: Rook HC
de: Turm Vorgabe
it: Handicap Torre
pl: Wieża forów
th: ลดเรือ

source: Rook+Lance HC
de: Turm + Lanze Vorgabe
it: Handicap Torre + Lancia
pl: Wieża + Lanca forów
th: ลดเรือและหอก

source: 2-Piece HC
de: 2-Figuren Vorgabe
it: Handicap di 2 pezzi
pl: 2 figury forów
th: ลด 2 ตัว

source: 4-Piece HC
de: 4-Figuren Vorgabe
it: Handicap di 4 pezzi
pl: 4 figury forów
th: ลด 4 ตัว

source: 6-Piece HC
de: 6-Piece Vorgabe
it: Handicap di 6 pezzi
pl: 6 figur forów
th: ลด 6 ตัว

source: 8-Piece HC
de: 8-Figuren Vorgabe
it: Handicap di 8 pezzi
pl: 8 figur forów
th: ลด 8 ตัว

source: 9-Piece HC
de: 9-Figuren Vorgabe
it: Handicap di 9 pezzi
pl: 9 figur forów
th: ลด 9 ตัว

source: 10-Piece HC
de: 10-Figuren Vorgabe
it: Handicap di 10 pezzi
pl: 10 figur forów
th: ลด 10 ตัว

source: Gorogoro Plus N+L
de: Gorogoro Plus S+L
it: Gorogoro Plus C+L
pl: Gorogoro plus skoczek+lanca
th: เพิ่มม้าและหอก

source: Original (No N+L)
de: Original (Ohne S+L)
it: Originale (No C+L)
pl: Oryginalne (bez skoczka i lancy)
th: ดั้งเดิม (ไม่มีม้าและหอก)

source: Left Quail HC
de: Linke Wachtel Vorgabe
it: Handicap Quaglia sinistra
pl: Lewa przepiórka forów
th: ลดนกกระทาซ้าย

source: Falcon HC
de: Falken Vorgabe
it: Handicap Falco
pl: Sokół forów
th: ลดเหยี่ยว

source: Falcon + Left Quail HC
de: Falke + Linke Wachtel Vorgabe
it: Handicap Falco + Quaglia sinistra
pl: Sokół + lewa przepiórka forów
th: ลดเหยี่ยวและนกกระทาซ้าย

source: Falcon + Both Quails HC
de: Falke + Beide Wachteln Vorgabe
it: Handicap Falco + 2 Quaglie
pl: Sokół + obie przepiórki forów
th: ลดเหยี่ยวและนกกระทาทั้งคู่

source: Bird
pl: Szachy Birda

source: Carrera
pl: Szachy Carrery

source: Gothic
it: Gotico
pl: Szachy gotyckie

source: Conservative
de: Konservativ
pl: Konserwatywne

source: Chess, unmodified, as it's played by FIDE standards.
de: Schach, unverändert, wie es nach dem FIDE Standard gespielt wird.
it: Scacchi non modificati, come giocati secondo regolamento FIDE
pl: Szachy bez modyfikacji, według zasad FIDE.
th: หมากรุกสากล ตามมาตรฐานของ FIDE

source: Take captured pieces and drop them back on to the board as your own.
de: Nimm geschlagene Figuren und setze sie wieder als deine eigenen Figuren ein.
it: Cattura i pezzi del tuo avversario e piazzali in gioco come tuoi.
pl: Bierz zbite bierki i dostawiaj je na plansze jako własne.
th: นำหมากที่กินได้กลับมาวางบนกระดานเป็นฝ่ายตัวเอง

source: Choose where your pieces start.
de: Wähle wo deine Figuren starten.
it: Scegli la posizione iniziale dei tuoi pezzi.
pl: Wybierz pozycje początkowe swoich figur.
th: เลือกตำแหน่งเริ่มต้นของตัวหมากได้เอง

source: Pieces explode upon capture.
de: Figuren explodieren beim Abtausch.
it: I pezzi esplodono a seduito di una cattura.
pl: Figury wybuchają podczas bicia.
th: ตัวหมากกินกันแล้วระเบิดได้

source: The duck must be moved to a new square after every turn.
de: Die Ente muss nach jedem Zug auf ein neues Feld bewegt werden.
pl: Kaczkę należy przestawić na inne pole po każdym ruchu.
th: มีเป็ดให้ย้ายไปวางที่อื่นทุกตา

source: Thai Chess. A game closely resembling the original Chaturanga. Similar to Chess but with a different queen and bishop.
de: Thai Schach. Ein Spiel das dem originalen Chaturanga sehr ähnelt. Ähnlich wie Schach, aber Dame und Läufer sind anders.
it: Scacchi thailandesi. Un gioco molto simile al Chaturanga originale. Simile agli scacchi ma con donna e alfiere diversi.
pl: Szachy tajskie. Gra bliźniaczo podobna do oryginalnej Czaturangi. Podobna do szachów ale z innymi hetmanami i gońcami.
th: หมากรุกไทย เกมที่มีความคล้ายคลึงกับจตุรงค์ดั้งเดิม

source: Makruk variant where kings cannot move to escape out of check.
de: Makruk Variante wo Könige sich nicht aus dem Schach bewegen können.
it: Variante del Makruk in cui i re non possono muovere per scansarsi dallo scacco.
pl: Odmiana Makruka, w której króle nie mogą się ruszyć odchodząc spod szacha.
th: หมากป้อง รูปแบบหนึ่งของหมากรุกไทยที่ห้ามขยับขุนหนีเมื่อโดนรุก

source: Cambodian Chess. Makruk with a few additional opening abilities.
de: Kambodschanisches Schach. Makruk mit etwas mehr Eröffnungsmöglichkeiten.
it: Scacchi cambogiani. Makruk con qualche possibilità aggiuntiva in apertura.
pl: Szachy kambodżańskie. Makruk z kilkoma dodatkowymi możliwymi ruchami w debiucie.
th: หมากรุกกัมพูชา คล้ายหมากรุกไทย มีสูตรขุนและสูตรเม็ดตอนต้นกระดาน

source: Burmese Chess. Similar to Makruk, but pieces are placed at the start of the match.
de: Birmanisches Schach. Ähnlich zu Makruk, aber die Figuren werden am Anfang der Partie gesetzt.
it: Scacchi birmani. Simili al Makruk, ma i pezzi vengono posizionati all'inizio della partita.
pl: Szachy birmańskie. Podobne do Makruka, ale figury są ustawiane na początku partii.
th: หมากรุกพม่า คล้ายหมากรุกไทย สามารถเลือกตำแหน่งหมากตอนเริ่มเกมได้
